nxp-mcuxpresso/mcuxsdk-examples/_boards/mcimx93qsb/common/pin_mux/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPSPI3Pins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: K14, peripheral: LPSPI3, signal: 'lpspi_pcs, 0', pin_signal: GPIO_IO08}
  - {pin_num: G16, peripheral: LPSPI3, signal: lpspi_sck, pin_signal: GPIO_IO11}
  - {pin_num: F16, peripheral: LPSPI3, signal: lpspi_sin, pin_signal: GPIO_IO09}
  - {pin_num: F17, peripheral: LPSPI3, signal: lpspi_sout, pin_signal: GPIO_IO10}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPSPI3Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPSPI3Pins(void) {                          /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO08__LPSPI3_PCS0, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO09__LPSPI3_SIN, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO10__LPSPI3_SOUT, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO11__LPSPI3_SCK, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCANPins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: A10, peripheral: CAN1, signal: can_rx, pin_signal: PDM_BIT_STREAM0, APC: DOMAIN0_ACCESS, HYS: DISABLED}
  - {pin_num: A16, peripheral: CAN1, signal: can_tx, pin_signal: PDM_CLK, HYS: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCANPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCANPins(void) {                             /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_PDM_BIT_STREAM0__CAN1_RX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_PDM_BIT_STREAM0__CAN1_RX, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_PDM_CLK__CAN1_TX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_PDM_CLK__CAN1_TX, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitNETQOSPins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: T8, peripheral: ENET_QOS, signal: enet_qos_mdc, pin_signal: ENET1_MDC, OD: DISABLED, DSE: X6}
  - {pin_num: U7, peripheral: ENET_QOS, signal: enet_qos_mdio, pin_signal: ENET1_MDIO, OD: DISABLED, DSE: X6}
  - {pin_num: U9, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 0', pin_signal: ENET1_TD0, OD: DISABLED, PD: DISABLED, DSE: X6}
  - {pin_num: R9, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 1', pin_signal: ENET1_TD1, OD: DISABLED, PD: DISABLED, DSE: X6}
  - {pin_num: U10, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 2', pin_signal: ENET1_TD2, OD: DISABLED, PD: DISABLED, DSE: X6}
  - {pin_num: T10, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 3', pin_signal: ENET1_TD3, OD: DISABLED, PD: DISABLED, DSE: X6}
  - {pin_num: T9, peripheral: ENET_QOS, signal: enet_qos_rgmii_tx_ctl, pin_signal: ENET1_TX_CTL, OD: DISABLED, PD: DISABLED, DSE: X6}
  - {pin_num: U8, peripheral: ENET_QOS, signal: ccm_enet_qos_clock_generate_tx_clk, pin_signal: ENET1_TXC, OD: DISABLED, PD: DISABLED, FSEL1: FAST_SLEW_RATE, DSE: X6}
  - {pin_num: U4, peripheral: ENET_QOS, signal: ccm_enet_qos_clock_generate_rx_clk, pin_signal: ENET1_RXC, OD: DISABLED, FSEL1: FAST_SLEW_RATE, DSE: X6}
  - {pin_num: T5, peripheral: ENET_QOS, signal: enet_qos_rgmii_rx_ctl, pin_signal: ENET1_RX_CTL, OD: DISABLED, DSE: X6}
  - {pin_num: U5, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 0', pin_signal: ENET1_RD0, OD: DISABLED, DSE: X6}
  - {pin_num: T6, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 1', pin_signal: ENET1_RD1, OD: DISABLED, DSE: X6}
  - {pin_num: U6, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 2', pin_signal: ENET1_RD2, OD: DISABLED, DSE: X6}
  - {pin_num: T7, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 3', pin_signal: ENET1_RD3, OD: DISABLED, DSE: X6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitNETQOSPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitNETQOSPins(void) {                          /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_MDC__ENET_QOS_MDC, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_MDC__ENET_QOS_MDC, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_MDIO__ENET_QOS_MDIO, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_MDIO__ENET_QOS_MDIO, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD0__ENET_QOS_RGMII_RD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD0__ENET_QOS_RGMII_RD0, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD1__ENET_QOS_RGMII_RD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD1__ENET_QOS_RGMII_RD1, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD2__ENET_QOS_RGMII_RD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD2__ENET_QOS_RGMII_RD2, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD3__ENET_QOS_RGMII_RD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD3__ENET_QOS_RGMII_RD3, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RXC__CCM_ENET_QOS_CLOCK_GENERATE_RX_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RXC__CCM_ENET_QOS_CLOCK_GENERATE_RX_CLK, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(3U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RX_CTL__ENET_QOS_RGMII_RX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RX_CTL__ENET_QOS_RGMII_RX_CTL, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD0__ENET_QOS_RGMII_TD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD0__ENET_QOS_RGMII_TD0, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD1__ENET_QOS_RGMII_TD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD1__ENET_QOS_RGMII_TD1, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD2__ENET_QOS_RGMII_TD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD2__ENET_QOS_RGMII_TD2, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD3__ENET_QOS_RGMII_TD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD3__ENET_QOS_RGMII_TD3, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TXC__CCM_ENET_QOS_CLOCK_GENERATE_TX_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TXC__CCM_ENET_QOS_CLOCK_GENERATE_TX_CLK, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(3U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TX_CTL__ENET_QOS_RGMII_TX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TX_CTL__ENET_QOS_RGMII_TX_CTL, 
                        IOMUXC_PAD_DSE(63U) |
                        IOMUXC_PAD_FSEL1(2U));
}


