nxp-mcuxpresso/mcuxsdk-examples/_boards/mcimx93qsb/common/pin_mux/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIOPins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: C16, peripheral: FLEXIO1, signal: 'flexio_flexio, 02', pin_signal: GPIO_IO02, SION: ENABLED, OD: ENABLED, PD: DISABLED, DSE: X4}
  - {pin_num: C17, peripheral: FLEXIO1, signal: 'flexio_flexio, 03', pin_signal: GPIO_IO03, SION: ENABLED, OD: ENABLED, PD: DISABLED, DSE: X4}
  - {pin_num: D16, peripheral: FLEXIO1, signal: 'flexio_flexio, 04', pin_signal: GPIO_IO04, SION: ENABLED, OD: DISABLED, PD: DISABLED}
  - {pin_num: D17, peripheral: FLEXIO1, signal: 'flexio_flexio, 05', pin_signal: GPIO_IO05, PD: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIOPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIOPins(void) {                          /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO02__FLEXIO1_FLEXIO02, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO02__FLEXIO1_FLEXIO02, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO03__FLEXIO1_FLEXIO03, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO03__FLEXIO1_FLEXIO03, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO04__FLEXIO1_FLEXIO04, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO04__FLEXIO1_FLEXIO04, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO05__FLEXIO1_FLEXIO05, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO05__FLEXIO1_FLEXIO05, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPI1Pins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: T16, peripheral: FLEXSPI1, signal: flexspi_a_sclk, pin_signal: SD3_CLK, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: R16, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 00', pin_signal: SD3_DATA0, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: R17, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 01', pin_signal: SD3_DATA1, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: P16, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 02', pin_signal: SD3_DATA2, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: P17, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 03', pin_signal: SD3_DATA3, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: T17, peripheral: FLEXSPI1, signal: 'flexspi_a_ss_b, 0', pin_signal: SD3_CMD}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitXSPI1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitXSPI1Pins(void) {                           /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_SD3_CLK__FLEXSPI1_A_SCLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SD3_CLK__FLEXSPI1_A_SCLK, 
                        IOMUXC_PAD_DSE(63U));
    IOMUXC_SetPinMux(IOMUXC_PAD_SD3_CMD__FLEXSPI1_A_SS0_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_SD3_DATA0__FLEXSPI1_A_DATA00, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SD3_DATA0__FLEXSPI1_A_DATA00, 
                        IOMUXC_PAD_DSE(63U));
    IOMUXC_SetPinMux(IOMUXC_PAD_SD3_DATA1__FLEXSPI1_A_DATA01, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SD3_DATA1__FLEXSPI1_A_DATA01, 
                        IOMUXC_PAD_DSE(63U));
    IOMUXC_SetPinMux(IOMUXC_PAD_SD3_DATA2__FLEXSPI1_A_DATA02, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SD3_DATA2__FLEXSPI1_A_DATA02, 
                        IOMUXC_PAD_DSE(63U));
    IOMUXC_SetPinMux(IOMUXC_PAD_SD3_DATA3__FLEXSPI1_A_DATA03, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SD3_DATA3__FLEXSPI1_A_DATA03, 
                        IOMUXC_PAD_DSE(63U));
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI3CPins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: A12, peripheral: I3C1, signal: i3c_scl, pin_signal: I2C1_SCL, SION: ENABLED, HYS: DISABLED}
  - {pin_num: B12, peripheral: I3C1, signal: i3c_sda, pin_signal: I2C1_SDA, SION: ENABLED, HYS: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI3CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI3CPins(void) {                             /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_I2C1_SCL__I3C1_SCL, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_I2C1_SCL__I3C1_SCL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_I2C1_SDA__I3C1_SDA, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_I2C1_SDA__I3C1_SDA, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}


